benchmark/ssl-nginx/res/test-log-user-1.txt
Running 10s test @ https://127.0.0.1:4043/index.html
  4 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    36.01ms   29.87ms 313.29ms   92.25%
    Req/Sec     3.30k     1.35k    8.09k    74.39%
  123589 requests in 10.05s, 32.41MB read
Requests/sec:  12298.66
Transfer/sec:      3.23MB
Running 10s test @ https://127.0.0.1:4043/data/example1k.txt
  4 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    41.12ms   69.36ms 623.99ms   92.91%
    Req/Sec     3.83k     2.00k    9.36k    63.87%
  146792 requests in 10.16s, 179.61MB read
Requests/sec:  14450.79
Transfer/sec:     17.68MB
Running 10s test @ https://127.0.0.1:4043/data/example2k.txt
  4 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    25.16ms   10.21ms 240.94ms   88.58%
    Req/Sec     4.17k     1.39k    9.66k    79.84%
  161145 requests in 10.09s, 354.08MB read
Requests/sec:  15966.67
Transfer/sec:     35.08MB
Running 10s test @ https://127.0.0.1:4043/data/example4k.txt
  4 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    30.71ms   23.95ms 460.21ms   98.48%
    Req/Sec     3.93k     1.07k    7.63k    74.28%
  149838 requests in 10.10s, 621.17MB read
Requests/sec:  14840.60
Transfer/sec:     61.52MB
Running 10s test @ https://127.0.0.1:4043/data/example16k.txt
  4 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    45.57ms   32.91ms 453.18ms   95.04%
    Req/Sec     2.53k     1.03k    6.69k    69.41%
  95572 requests in 10.07s, 1.48GB read
Requests/sec:   9493.46
Transfer/sec:    150.30MB
Running 10s test @ https://127.0.0.1:4043/data/example128k.txt
  4 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   198.41ms   98.75ms 852.66ms   83.76%
    Req/Sec   668.37    364.87     1.76k    64.25%
  24354 requests in 10.08s, 2.97GB read
Requests/sec:   2416.83
Transfer/sec:    301.84MB
Running 10s test @ https://127.0.0.1:4043/data/example256k.txt
  4 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    68.60ms   23.00ms 129.21ms   66.52%
    Req/Sec   554.61    375.95     1.60k    78.23%
  21807 requests in 10.08s, 5.31GB read
Requests/sec:   2163.65
Transfer/sec:    539.95MB